## Pandas Provide Two Data Structures
## Series
## Dataframe

In [1]:
import pandas as pd
import numpy as np

In [2]:

data={"country":["india","uk","austria","us"],"GDP":[123,345,678,2134]}
data

{'country': ['india', 'uk', 'austria', 'us'], 'GDP': [123, 345, 678, 2134]}

In [3]:
df=pd.DataFrame(data)
df

   country   GDP
0    india   123
1       uk   345
2  austria   678
3       us  2134

In [4]:
import numpy as np
data1={"country":["india","uk","austria","us",np.nan],"GDP":[123,345,678,np.nan,2134]}
data1

{'country': ['india', 'uk', 'austria', 'us', nan],
 'GDP': [123, 345, 678, nan, 2134]}

In [5]:
df=pd.DataFrame(data1)
df

   country     GDP
0    india   123.0
1       uk   345.0
2  austria   678.0
3       us     NaN
4      NaN  2134.0

In [6]:
d={"name":["piya","riya","asshi","meera"],"age":['20','30','60','23'],\
   "height":[120.3,152.4,155,162],"gender":["f","f","m","f"]}  ## \ is used to break the lines
df=pd.DataFrame(d)

In [7]:
df

    name age  height gender
0   piya  20   120.3      f
1   riya  30   152.4      f
2  asshi  60   155.0      m
3  meera  23   162.0      f

In [8]:
### Checking Colums Type
df.dtypes

name       object
age        object
height    float64
gender     object
dtype: object

In [9]:
### TAsk 1 : take a string from user
for example = 0:
#### taskw2 : Use The Ascii Value Of String as Key
##

SyntaxError: invalid syntax (1253930574.py, line 2)

In [ ]:
df["age"]=df["age"].astype(int)

In [ ]:
df.dtypes

In [ ]:
## For checking a single colum
df["age"].dtype

#### information on the dataframe

In [ ]:
df.info()

### Creating a data frame from list

In [ ]:
l1=[1,2,3,4,5]
df=pd.DataFrame(l1)
df

In [ ]:
l1=[[1,2,3,4,5],[6,7,8,9,0]]
df=pd.DataFrame(l1)
df

In [ ]:
df.index

In [ ]:
### To Fetch Column Name
df.columns

In [ ]:
l1=[[1,2,3,4,5],[6,7,8,9,0]]
df=pd.DataFrame(l1,index=["a","b"],columns=["a","b","c","d","e"])
df

In [13]:
## Dealing with rows

data={"country":["india","uk","austria","us","canada","pakistan"],"GDP":[123,123,678,2134,3456,232],"country_type":["developing","developed","developed","developed","developed","developing"]}  # from dictionary 
df=pd.DataFrame(data)
df

    country   GDP country_type
0     india   123   developing
1        uk   123    developed
2   austria   678    developed
3        us  2134    developed
4    canada  3456    developed
5  pakistan   232   developing

In [ ]:
## Fetch Top Five rows
df.head

In [ ]:
## Fetch bottom 5 rows
df.tail

## iloc

In [ ]:
df.iloc[1]

In [ ]:
df.iloc[-1]

In [ ]:
## to fetch alternate rows
df.iloc[0:5:2]

In [ ]:
## to fetch alternate rows
df.iloc[2:5]

In [ ]:
## To fetch Specific Rows
df.iloc[[2,5,3]]

In [14]:
## To Specific Columns 
df.iloc[:,2]

0    developing
1     developed
2     developed
3     developed
4     developed
5    developing
Name: country_type, dtype: object

In [ ]:
df.iloc[:,1:]

In [ ]:
## to fetch specific rows and columns
df.iloc[[2,4],[0,2]]

## LOC - Accessing with Name

In [ ]:
df.iloc[:,"country_type"]  ## raises error

In [ ]:
df.set_index(df["country"],inplace=True)
df

In [ ]:
df.index

In [ ]:
df.columns

In [ ]:
df.drop(columns=["country"],inplace=True)
df

In [ ]:
df.loc["uk"]

In [ ]:
df.loc[["uk","canada"]]

In [ ]:
df.loc[:,["GDP"]]

#### Resetting Index

In [ ]:
df.reset_index(inplace=True)
df

In [ ]:
## Adding the rows of one dataframe to target dataframe using append

d = pd.DataFrame([[7, 8], [9, 10]], columns = ['x','y'])  
d2 = pd.DataFrame([[11, 12]],columns = ['1','2'])

In [ ]:
d

In [ ]:
d2

In [ ]:
d=d.append(d2,ignore_index=True)
d

In [ ]:
d2=d.append(d2,)
d2

In [ ]:
d = pd.DataFrame([[7, 8], [9, 10]], columns = ['1','2'])  
d2 = pd.DataFrame([[11, 12]],columns = ['1','2']) 
d=d.append(d2,ignore_index=True)
d

In [3]:

d1 = {'Name':['Martha', 'Tim', 'Rob', 'Georgia'],
        'Maths':[87, 91, 97, 95],
        'Science':[83, 99, 84, 76]
       }
df=pd.DataFrame(d1)
df

      Name  Maths  Science
0   Martha     87       83
1      Tim     91       99
2      Rob     97       84
3  Georgia     95       76

In [4]:
df.iloc[2]=["Steven",89,99]
df

      Name  Maths  Science
0   Martha     87       83
1      Tim     91       99
2   Steven     89       99
3  Georgia     95       76

In [ ]:
df.iloc[1:3]=[["Steven",89,99],["washington",79,82]]
df

In [ ]:
df["Name"].iloc[0]="Neelam"
df

### loc

In [7]:
df.set_index("Name",inplace=True)
df

         Maths  Science
Name
Martha      87       83
Tim         91       99
Steven      89       99
Georgia     95       76

In [8]:
df.loc["jay"]=[23,45]
df

         Maths  Science
Name
Martha      87       83
Tim         91       99
Steven      89       99
Georgia     95       76
jay         23       45

In [9]:
df.reset_index(inplace=True)
df

      Name  Maths  Science
0   Martha     87       83
1      Tim     91       99
2   Steven     89       99
3  Georgia     95       76
4      jay     23       45

## Row deletion

In [10]:

df1=df.drop(1)

In [11]:
df

      Name  Maths  Science
0   Martha     87       83
1      Tim     91       99
2   Steven     89       99
3  Georgia     95       76
4      jay     23       45

In [12]:
df=pd.DataFrame({"state":["delhi","gujrat","up","goa","mp","sikkim"],"population":[90,80,70,10,34,30],"state_region":["north","west","north","south","south","east"]})
df

    state  population state_region
0   delhi          90        north
1  gujrat          80         west
2      up          70        north
3     goa          10        south
4      mp          34        south
5  sikkim          30         east

## Deleting alternate rows

In [ ]:
df.drop(index=df.index[0:6:2])

## Deleting Specific Rows

In [ ]:
df

In [ ]:
df.drop(0,6)

In [ ]:
df[["state","state_region"]]

## Column Renaming

In [ ]:
df.rename(columns={"state":"country_state"},inplace=True)

In [ ]:
df

## Changing multiple columns

In [ ]:
df

In [ ]:
df.rename(columns={"state":"country_state","population":"TotalPeople"},inplace=True)
df

## Column Reordering

In [ ]:
df=df[["population","country_state","state_region"]]
df

In [ ]:
df.rename(columns={"state":"country_state"},inplace=True)

In [ ]:
df

In [ ]:
df=df[["population","country_state","state_region"]]
df

## Addition Of New Column

In [ ]:
l=[]
for i in df["population"]:
    l.append(i*i)
l
psqaure=pd.

## Extracting Column Names Of Particular Types

In [ ]:
df.dtypes

In [ ]:
df.select_dtypes(include="object")

In [ ]:
df["population"]=df["population"].astype("float")
df.dtypes

In [ ]:
numeric=["float","int"]
df.select_dtypes(include=numeric)

# Series

In [ ]:
# Creating a series

In [ ]:
data=np.array(["g","e","e","k","s"])
series=pd.Series(data)
series

In [ ]:
l=[["a","b","c"]]
ser1=pd.Series(l)
ser1

In [ ]:
l=[["a","b","c"],["aa","bb","cc"]]
series=pd.Series(l)
series

In [ ]:
ser=tuple(range(1,10))
series=pd.Series(ser)
series

In [ ]:
## From Dictionary
d={"a":10,"b":20,"c":30}
ser=pd.Series(data=d)
ser

In [ ]:
ser1=pd.Series(data=d, index=["x","y","z"])
ser1 ##

In [ ]:
k=ser1.reset_index()

In [ ]:
ser1.drop(columns=[0],inplace=True)
ser1

In [ ]:
x=pd.Series(4, index=[0,1,2,3])
x

In [ ]:
x=pd.Series([1,2,3,4,5],index=["a","b","c","d","e"],)
x

In [ ]:
x["d"]

In [ ]:
x["b":"e"] ## to fectch multiple rows

In [ ]:
x ## to fetch whole series

In [2]:
## create dataframe of datas
date=pd.date_range("1/1/2000",periods=12,freq="M")
date

DatetimeIndex(['2000-01-31', '2000-02-29', '2000-03-31', '2000-04-30',
               '2000-05-31', '2000-06-30', '2000-07-31', '2000-08-31',
               '2000-09-30', '2000-10-31', '2000-11-30', '2000-12-31'],
              dtype='datetime64[ns]', freq='M')

In [3]:
x1=pd.DataFrame(date,columns=["dates"])
x1

        dates
0  2000-01-31
1  2000-02-29
2  2000-03-31
3  2000-04-30
4  2000-05-31
5  2000-06-30
6  2000-07-31
7  2000-08-31
8  2000-09-30
9  2000-10-31
10 2000-11-30
11 2000-12-31

In [12]:
## Task Add A New Columns In This Dataframe
a=np.arange(12)

In [13]:
x1["new_column"]=pd.Series(a)
x1

        dates  new_column
0  2000-01-01           0
1  2000-01-02           1
2  2000-01-03           2
3  2000-01-04           3
4  2000-01-05           4
5  2000-01-06           5
6  2000-01-07           6
7  2000-01-08           7
8  2000-01-09           8
9  2000-01-10           9
10 2000-01-11          10
11 2000-01-12          11

In [14]:
## Task 2 Dates == Index
x1.set_index(x1["dates"],inplace=True)

In [15]:
x1

                dates  new_column
dates
2000-01-01 2000-01-01           0
2000-01-02 2000-01-02           1
2000-01-03 2000-01-03           2
2000-01-04 2000-01-04           3
2000-01-05 2000-01-05           4
2000-01-06 2000-01-06           5
2000-01-07 2000-01-07           6
2000-01-08 2000-01-08           7
2000-01-09 2000-01-09           8
2000-01-10 2000-01-10           9
2000-01-11 2000-01-11          10
2000-01-12 2000-01-12          11

In [16]:
x1.drop(columns="dates",inplace=True)

In [17]:
x1

            new_column
dates
2000-01-01           0
2000-01-02           1
2000-01-03           2
2000-01-04           3
2000-01-05           4
2000-01-06           5
2000-01-07           6
2000-01-08           7
2000-01-09           8
2000-01-10           9
2000-01-11          10
2000-01-12          11

In [18]:
x1.reset_index(inplace=True)

In [19]:
x1

        dates  new_column
0  2000-01-01           0
1  2000-01-02           1
2  2000-01-03           2
3  2000-01-04           3
4  2000-01-05           4
5  2000-01-06           5
6  2000-01-07           6
7  2000-01-08           7
8  2000-01-09           8
9  2000-01-10           9
10 2000-01-11          10
11 2000-01-12          11